Autodesk.Revit.UI.FileSaveDialog.EnableCloudWorkflow
Indicates if the File Save Dialog should enable working with files in the cloud.
Since:
2017

Autodesk.Revit.UI.FileSaveDialog.InitialFileName
The initial file name to be shown for this save operation.
This would typically be a name derived by the application that matches the purpose of the save operation
it intends to do.  The user is permitted to alter the initial file name.
If the extension is not included, the file would be given the selected file extension
for the active filter (when saved).  If the extension is included, it will be ignored if the extension does
not match one of the possible filter extensions. When not set, the file name entry field in the dialog will
be blank and the user will have to enter a file name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: initialFileName cannot include prohibited unprintable characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FileSaveDialog.#ctor(System.String)
Constructs a new instance of a File Save dialog.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.FileSaveDialog
This class allows an add-in to prompt the user with the Revit dialog used to navigate to and select an existing
or new file path.  This dialog is typically used to enter a file name for saving or exporting.
Remarks:
The behavior and appearance of this dialog matches the Revit "Save as" dialog.  This is a general-purpose dialog
for saving any given file type, and the Options shown in the dialog for Revit projects and families will not be
shown.  To prompt the user to save the active Revit document specifically, use UIDocument.SaveAs(UISaveAsOptions) instead.
The user will be requested to select or enter a file name matching the corresponding filter.
If an existing file is selected, there will be
a default prompt about overwriting the file shown, where the user can confirm or cancel this file selection.
The folder location shown when the dialog is displayed defaults to the most recently used file location
for saving or exporting.
Use of this dialog does not actually save an existing file, but it will provide the selected file path
back to the caller to take any action necessary.
Since:
2017